Revit 2027 API
PipeFittingAndAccessoryPressureDropData.CalculationType Property
 The calculation type, a bitmask of FittingAndAccessoryCalculationType.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int CalculationType { get; }
Public ReadOnly Property CalculationType As Integer
	Get
public:
property int CalculationType {
	int get ();
}
member CalculationType : int with get
Property Value
Int32
See Also
Reference
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace